Revit 2026 API

# PipingSystemCreateHydraulicSeparation Method

---
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> CreateHydraulicSeparation(
	Document document,
	ISet<ElementId> pipeElementIds
)
```
```vb
Public Shared Function CreateHydraulicSeparation (
	document As Document,
	pipeElementIds As ISet(Of ElementId)
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ CreateHydraulicSeparation(
	Document^ document,
	ISet<ElementId^>^ pipeElementIds
)
```
```fsharp
static member CreateHydraulicSeparation :
        document : Document *
        pipeElementIds : ISet<ElementId> -> ISet<ElementId>
```

#### Parameters

document Document

pipeElementIds ISetElementId

#### Return Value

ISetElementId

#### Reference

PipingSystem Class

Autodesk.Revit.DB.Plumbing Namespace